lamer0k/CortexLib/Tools/RegistersGenerator/Milandr/MDR1986VE8.svd
        <!-- CPU_CHK0 -->
        <register>
          <name>CPU_CHK0</name>
          <description>Clock Checker Register</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields> 
            <field>
              <name>PRES_REG2</name>
              <description>FreqRef Prescaller for Slow</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>PRES_REG0</name>
              <description>FreqRef Prescaller for Fast</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <!-- CPU_CHK1 -->
        <register>
          <name>CPU_CHK1</name>
          <description>Clock Checker Register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields> 
            <field>
              <name>PRES_REG1</name>
              <description>Clock Prescaller for Fast</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>PRES_REG3</name>
              <description>Clock Prescaller for Slow</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <!-- CPU_CHK2 -->
        <register>
          <name>CPU_CHK2</name>
          <description>Clock Checker Register</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields> 
            <field>
              <name>BASE_REG0</name>
              <description>Min factor for SLOWEST</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>BASE_REG1</name>
              <description>Min factor for SLOW</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>BASE_REG2</name>
              <description>Max factor for FAST</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>BASE_REG3</name>
              <description>Max factor for FASTEST</description>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <!-- CPU_STAT -->
        <register>
          <name>CPU_STAT</name>
          <description>Clock Status Register</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>
          <fields> 
            <!-- #CLK_STATUS_EVENTS -->
            <field>
              <name>MAX_CLK_SHIFT_REG0</name>
              <description>Max factor detected for SLOW</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>MAX_CLK_SHIFT_REG1</name>
              <description>Max factor detected for FAST</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>EVENT0</name>
              <description>Event SLOWEST</description>
              <bitRange>[16:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Inactive</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Active</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="EVENT0">
              <name>EVENT1</name>
              <description>Event SLOW</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field derivedFrom="EVENT0">
              <name>EVENT2</name>
              <description>Event FAST</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field derivedFrom="EVENT0">
              <name>EVENT3</name>
              <description>Event FASTEST</description>
              <bitRange>[19:19]</bitRange>
            </field>
          </fields>
        </register>
        <!-- LSI_CLK -->
        <register>
          <name>LSI_CLK</name>
          <description>Clock Contorl Register</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07FF0000</resetMask>
          <fields>
            <!-- #CLK_CTRL_EVENTS -->
            <field>
              <name>EN_CHK_EVENT0</name>
              <description>Go to HSI on lose active clock</description>
              <bitRange>[16:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disable</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enable</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="EN_CHK_EVENT0">
              <name>EN_CHK_EVENT1</name>
              <description>Go to HSI if active clock is low</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field derivedFrom="EN_CHK_EVENT0">
              <name>EN_CHK_EVENT2</name>
              <description>Go to HSI if active clock is High</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field derivedFrom="EN_CHK_EVENT0">
              <name>EN_CHK_EVENT3</name>
              <description>Go to HSI if active clock is Highest</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field derivedFrom="EN_CHK_EVENT0">
              <name>EN_CHK</name>
              <description>Clock Checker enable</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CLR_CHK_SHIFT_REG0</name>
              <description>Clear Min Freq level</description>
              <bitRange>[21:21]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Inactive</name><description>No action</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Clear</name><description>Clear level</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="CLR_CHK_SHIFT_REG0">
              <name>CLR_CHK_SHIFT_REG1</name>
              <description>Clear Max Freq level</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field derivedFrom="CLR_CHK_SHIFT_REG0">
              <name>CLR_CHK_EVENT0</name>
              <description>Clear no freq event</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field derivedFrom="CLR_CHK_SHIFT_REG0">
              <name>CLR_CHK_EVENT1</name>
              <description>Clear low freq event</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field derivedFrom="CLR_CHK_SHIFT_REG0">
              <name>CLR_CHK_EVENT2</name>
              <description>Clear high freq event</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field derivedFrom="CLR_CHK_SHIFT_REG0">
              <name>CLR_CHK_EVENT3</name>
              <description>Clear highest freq event</description>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <!-- LSI_CHK0 -->
        <register derivedFrom="CPU_CHK0">
          <name>LSI_CHK0</name>
          <addressOffset>0x00000028</addressOffset>
        </register>
        <!-- LSI_CHK1 -->
        <register derivedFrom="CPU_CHK1">
          <name>LSI_CHK1</name>
          <addressOffset>0x0000002C</addressOffset>
        </register>
        <!-- LSI_CHK2 -->
        <register derivedFrom="CPU_CHK2">
          <name>LSI_CHK2</name>
          <addressOffset>0x00000030</addressOffset>
        </register>        
