lamer0k/CortexLib/Tools/RegistersGenerator/Milandr/MDR1986VE8.svd
        <!-- LSI_STAT -->
        <register>
          <name>LSI_STAT</name>
          <description>Clock Status Register</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>
          <fields> 
            <!-- #CLK_STATUS_EVENTS -->
            <field>
              <name>MAX_CLK_SHIFT_REG0</name>
              <description>Max factor detected for SLOW</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>MAX_CLK_SHIFT_REG1</name>
              <description>Max factor detected for FAST</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>EVENT0</name>
              <description>Event SLOWEST</description>
              <bitRange>[16:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Inactive</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Active</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="EVENT0">
              <name>EVENT1</name>
              <description>Event SLOW</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field derivedFrom="EVENT0">
              <name>EVENT2</name>
              <description>Event FAST</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field derivedFrom="EVENT0">
              <name>EVENT3</name>
              <description>Event FASTEST</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>READY</name>
              <description>Clock Ready</description>
              <bitRange>[20:20]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Clock not Ready</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Clock Ready</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <!-- #SLI_RDY_ERR_VK14 -->
          </fields>
        </register>
        <!-- #HSI_STAT -->
        <register>
          <name>HSI_STAT</name>
          <description>HSI Status Register</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00100000</resetMask>
          <fields> 
            <field>
              <name>READY</name>
              <description>Clock Ready</description>
              <bitRange>[20:20]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Clock not Ready</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Clock Ready</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
          </fields>
        </register>
        <!-- LSE_CLK -->
        <register derivedFrom="LSI_CLK">
          <name>LSE_CLK</name>
          <addressOffset>0x0000003C</addressOffset>
        </register>
        <!-- LSE_CHK0 -->
        <register derivedFrom="CPU_CHK0">
          <name>LSE_CHK0</name>
          <addressOffset>0x00000040</addressOffset>
        </register>    
        <!-- LSE_CHK1 -->
        <register derivedFrom="CPU_CHK1">
          <name>LSE_CHK1</name>
          <addressOffset>0x00000044</addressOffset>
        </register>
        <!-- LSE_CHK2 -->
        <register derivedFrom="CPU_CHK2">
          <name>LSE_CHK2</name>
          <addressOffset>0x00000048</addressOffset>
        </register>
        <!-- LSE_STAT -->
        <register>
          <name>LSE_STAT</name>
          <description>Clock Status Register</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>
          <fields> 
            <!-- #CLK_STATUS_EVENTS -->        
            <field>
              <name>MAX_CLK_SHIFT_REG0</name>
              <description>Max factor detected for SLOW</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>MAX_CLK_SHIFT_REG1</name>
              <description>Max factor detected for FAST</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>EVENT0</name>
              <description>Event SLOWEST</description>
              <bitRange>[16:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Inactive</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Active</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="EVENT0">
              <name>EVENT1</name>
              <description>Event SLOW</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field derivedFrom="EVENT0">
              <name>EVENT2</name>
              <description>Event FAST</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field derivedFrom="EVENT0">
              <name>EVENT3</name>
              <description>Event FASTEST</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>READY</name>
              <description>Clock Ready</description>
              <bitRange>[20:20]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Clock not Ready</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Clock Ready</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
          </fields>
        </register>
        <!-- HSE0_CLK -->
        <register>
          <name>HSE0_CLK</name>
          <description>Clock Contorl Register</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07FF0000</resetMask>
          <fields>
            <!-- #CLK_CTRL_EVENTS -->
            <field>
              <name>EN_CHK_EVENT0</name>
              <description>Go to HSI on lose active clock</description>
              <bitRange>[16:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disable</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enable</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="EN_CHK_EVENT0">
              <name>EN_CHK_EVENT1</name>
              <description>Go to HSI if active clock is low</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field derivedFrom="EN_CHK_EVENT0">
              <name>EN_CHK_EVENT2</name>
              <description>Go to HSI if active clock is High</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field derivedFrom="EN_CHK_EVENT0">
              <name>EN_CHK_EVENT3</name>
              <description>Go to HSI if active clock is Highest</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field derivedFrom="EN_CHK_EVENT0">
              <name>EN_CHK</name>
              <description>Clock Checker enable</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CLR_CHK_SHIFT_REG0</name>
              <description>Clear Min Freq level</description>
              <bitRange>[21:21]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Inactive</name><description>No action</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Clear</name><description>Clear level</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="CLR_CHK_SHIFT_REG0">
              <name>CLR_CHK_SHIFT_REG1</name>
              <description>Clear Max Freq level</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field derivedFrom="CLR_CHK_SHIFT_REG0">
              <name>CLR_CHK_EVENT0</name>
              <description>Clear no freq event</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field derivedFrom="CLR_CHK_SHIFT_REG0">
              <name>CLR_CHK_EVENT1</name>
              <description>Clear low freq event</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field derivedFrom="CLR_CHK_SHIFT_REG0">
              <name>CLR_CHK_EVENT2</name>
              <description>Clear high freq event</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field derivedFrom="CLR_CHK_SHIFT_REG0">
              <name>CLR_CHK_EVENT3</name>
              <description>Clear highest freq event</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field derivedFrom="EN_CHK_EVENT0">
              <name>HSE_ON</name>
              <description>Generator Enable</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field derivedFrom="EN_CHK_EVENT0">
              <name>HSE_BYP</name>
              <description>ByPass Mode</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field derivedFrom="EN_CHK_EVENT0">
              <name>FILTER_EN</name>
              <description>Filter Enable</description>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
