lamer0k/CortexLib/Tools/RegistersGenerator/Milandr/MDR1986VE8.svd
        <!-- PLL1_CLK -->
        <register derivedFrom="PLL0_CLK">
          <name>PLL1_CLK</name>
          <addressOffset>0x0000008C</addressOffset>
        </register> 
        <!-- PLL1_CHK0 -->
        <register derivedFrom="CPU_CHK0">
          <name>PLL1_CHK0</name>
          <addressOffset>0x00000090</addressOffset>
        </register>    
        <!-- PLL1_CHK1 -->
        <register derivedFrom="CPU_CHK1">
          <name>PLL1_CHK1</name>
          <addressOffset>0x00000094</addressOffset>
        </register>
        <!-- PLL1_CHK2 -->
        <register derivedFrom="CPU_CHK2">
          <name>PLL1_CHK2</name>
          <addressOffset>0x00000098</addressOffset>
        </register>
        <!-- PLL1_STAT -->
        <register derivedFrom="LSE_STAT">
          <name>PLL1_STAT</name>
          <addressOffset>0x0000009C</addressOffset>
        </register>
        <!-- PLL2_CLK -->
        <register derivedFrom="PLL0_CLK">
          <name>PLL2_CLK</name>
          <addressOffset>0x000000A0</addressOffset>
        </register> 
        <!-- PLL2_CHK0 -->
        <register derivedFrom="CPU_CHK0">
          <name>PLL2_CHK0</name>
          <addressOffset>0x000000A4</addressOffset>
        </register>    
        <!-- PLL2_CHK1 -->
        <register derivedFrom="CPU_CHK1">
          <name>PLL2_CHK1</name>
          <addressOffset>0x000000A8</addressOffset>
        </register>
        <!-- PLL2_CHK2 -->
        <register derivedFrom="CPU_CHK2">
          <name>PLL2_CHK2</name>
          <addressOffset>0x000000AC</addressOffset>
        </register>
        <!-- PLL2_STAT -->
        <register derivedFrom="LSE_STAT">
          <name>PLL2_STAT</name>
          <addressOffset>0x000000B0</addressOffset>
        </register>
        <!-- #PLL3_ESila -->
        <!-- #PERIPH_CLK -->    
        <!-- CAN1_CLK -->
        <register>
          <name>CAN1_CLK</name>
          <description>Sync Clock Control</description>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1001FFF</resetMask>
          <fields> 
            <field>
              <name>DIV</name>
              <description>MAX_Clock Div to PeriphClock</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>PeriphClock Enable</description>
              <bitRange>[16:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Clock Off</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Clock On</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>     
          </fields>
        </register>
        <!-- TIM1_CLK -->
        <register derivedFrom="CAN1_CLK">
          <name>TIM1_CLK</name>
          <addressOffset>0x00000130</addressOffset>
        </register>
        <!-- TIM2_CLK -->
        <register derivedFrom="CAN1_CLK">
          <name>TIM2_CLK</name>
          <addressOffset>0x00000134</addressOffset>
        </register>
        <!-- TIM3_CLK -->
        <register derivedFrom="CAN1_CLK">
          <name>TIM3_CLK</name>
          <addressOffset>0x00000138</addressOffset>
        </register>
        <!-- TIM4_CLK -->
        <register derivedFrom="CAN1_CLK">
          <name>TIM4_CLK</name>
          <addressOffset>0x0000013C</addressOffset>
        </register>
        <!-- ETH_CLK -->
        <register>
          <name>ETH_CLK</name>
          <description>Async Clock Control</description>
          <addressOffset>0x00000170</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xF001FFF</resetMask>
          <fields> 
            <field>
              <name>DIV</name>
              <description>Div to PeriphClock</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>PeriphClock Enable</description>
              <bitRange>[16:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Clock Off</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Clock On</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field>
              <name>SELECT</name>
              <description>PeriphClock Enable</description>
              <bitRange>[31:28]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>HSI</name><description>Clock Source</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>HSE0</name><description>Clock Source</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>HSE1</name><description>Clock Source</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>LSI</name><description>Clock Source</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>LSE</name><description>Clock Source</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>PLL0</name><description>Clock Source</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>PLL1</name><description>Clock Source</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>PLL2</name><description>Clock Source</description><value>7</value></enumeratedValue>
                <enumeratedValue><name>MAX_CLK</name><description>Clock Source</description><value>13</value></enumeratedValue>
              </enumeratedValues>          
            </field>
          </fields>
        </register>
        <!-- SPW1_CLK -->
        <register derivedFrom="CAN1_CLK">
          <name>SPW1_CLK</name>
          <addressOffset>0x00000178</addressOffset>
        </register>
        <!-- UART1_CLK -->
        <register derivedFrom="ETH_CLK">
          <name>UART1_CLK</name>
          <addressOffset>0x00000188</addressOffset>
        </register>
        <!-- UART2_CLK -->
        <register derivedFrom="ETH_CLK">
          <name>UART2_CLK</name>
          <addressOffset>0x0000018C</addressOffset>
        </register>
        <!-- SSP1_CLK -->
        <register derivedFrom="ETH_CLK">
          <name>SSP1_CLK</name>
          <addressOffset>0x000001A0</addressOffset>
        </register>
        <!-- ADC1_CLK -->
        <register derivedFrom="ETH_CLK">
          <name>ADC1_CLK</name>
          <addressOffset>0x000001BC</addressOffset>
        </register>
        <!-- ADC2_CLK -->
        <register derivedFrom="ETH_CLK">
          <name>ADC2_CLK</name>
          <addressOffset>0x000001C0</addressOffset>
        </register>
        <!-- DAC1_CLK -->
        <register derivedFrom="ETH_CLK">
          <name>DAC1_CLK</name>
          <addressOffset>0x000001C4</addressOffset>
        </register>
