lamer0k/CortexLib/Tools/RegistersGenerator/Milandr/MDR1986VE8.svd
        <!-- DAC2_CLK -->
        <register derivedFrom="ETH_CLK">
          <name>DAC2_CLK</name>
          <addressOffset>0x000001C8</addressOffset>
        </register>
        <!-- RTC_CLK -->
        <register derivedFrom="ETH_CLK">
          <name>RTC_CLK</name>
          <addressOffset>0x000001CC</addressOffset>
        </register>
        <!-- Registers end-->
      </registers>
      <!-- peripheral end-->
    </peripheral>
    <!-- #BKP -->
    <!-- BKP and RTC -->
    <peripheral>
      <name>MDR_BKP</name>
      <version>1.0</version>
      <description>Backup and RTC Control</description>
      <groupName>BKP and RTC</groupName>
      <baseAddress>0x40001000</baseAddress>
      <size>32</size>
      <access>read-write</access>
      <addressBlock>
        <offset>0</offset>
        <!-- #BKP_Size  -->
        <size>0x184</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <!-- REG_x -->
        <register>
          <dim>60</dim>
          <dimIncrement>4</dimIncrement>
          <name>REG[%s]</name>
          <description>User backup registers</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- KEY -->
        <register>
          <name>KEY</name>
          <description>Unlock BKP and RTC Registers</description>
          <addressOffset>0x000000F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- #REGs_64_ESila -->
        <!-- REG_60_TMR0 -->
        <register>
          <name>REG_60_TMR0</name>
          <description>REG60 Control register</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!-- #REG60_FLDS -->
          <resetMask>0xFF3FFFFF</resetMask>      
          <fields>
            <field>
              <name>MODE</name>
              <description>Boot Mode</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>FPOR</name>
              <description>Bootloader completed</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Bootloader</name><description>Bootloader active</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Completed</name><description>Bootloader completed</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S_UccReset</name>
              <description>Reset by Ucc</description>
              <bitRange>[8:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Event Inactive</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Event Active</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="S_UccReset">
              <name>S_RSTn0</name>
              <description>Reset by RSTn0 signal</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field derivedFrom="S_UccReset">
              <name>S_FT_Reset</name>
              <description>Reset from FT_CNTR</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field derivedFrom="S_UccReset">
              <name>S_WDT_Reset</name>
              <description>Reset from WDT</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field derivedFrom="S_UccReset">
              <name>S_RSTn1</name>
              <description>Reset by RSTn1 signal</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field derivedFrom="S_UccReset">
              <name>S_OVRSTn</name>
              <description>Reset by Ucc > U_over (5.75V)</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field derivedFrom="S_UccReset">
              <name>S_SYSRSTn</name>
              <description>Reset by software</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>JTAG_Enable</name>
              <description>Disable JTAG</description>
              <bitRange>[15:15]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>On</name><description>Enabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Off</name><description>Disabled</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field>
              <name>LimEn_LDO_DUcc0</name>
              <description>Enable limit for DUcc0 (~300mA)</description>
              <bitRange>[16:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disable</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enable</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="LimEn_LDO_DUcc0">
              <name>LimEn_LDO_DUcc1</name>
              <description>Enable limit for DUcc1 (~300mA)</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field derivedFrom="LimEn_LDO_DUcc0">
              <name>LimEn_LDO_DUcc2</name>
              <description>Enable limit for DUcc2 (~300mA)</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field derivedFrom="LimEn_LDO_DUcc0">
              <name>LimEn_LDO_DUcc3</name>
              <description>Enable limit for DUcc3 (~300mA)</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field derivedFrom="LimEn_LDO_DUcc0">
              <name>LimEn_LDO_BUcc</name>
              <description>Enable limit for DUcc_Bat (~50mA)</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field derivedFrom="LimEn_LDO_DUcc0">
              <name>LimEn_LDO_PLL</name>
              <description>Enable limit for DUcc_PLL (~50mA)</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field derivedFrom="S_UccReset">
              <name>ERR_REG60x</name>
              <description>Fault in REG_60x</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field derivedFrom="S_UccReset">
              <name>ERR_REG61x_62x</name>
              <description>Fault in REG_61x or REG_62x </description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field derivedFrom="S_UccReset">
              <name>ERR_REG63x</name>
              <description>Fault in REG_63x</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field derivedFrom="JTAG_Enable">
              <name>PORSTn_En</name>
              <description>Enable reset by Ucc > U_POR (2.5V)</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field derivedFrom="JTAG_Enable">
              <name>OVRSTn_En</name>
              <description>Enable reset by Ucc > U_over (5.75V)</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CLR_ERR</name>
              <description>Clear Errors of REG_60x - 63x</description>
              <bitRange>[30:30]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Inactive</name><description>Disable</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Clear</name><description>Clear Errors</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERR_IRQ_EN</name>
              <description>Enable BKP_IRQn on Errors</description>
              <bitRange>[31:31]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disable</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enable</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!-- REG_61_TMR0 -->
        <register>
          <name>REG_61_TMR0</name>
          <description>REG61 Control register</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!-- #REG61_FLDS -->
          <resetMask>0xFFFFFFFF</resetMask>      
          <fields>
            <field>
              <name>LDO0_SRILow</name>
              <description>LDO Power adjustment</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>ge10MHz</name><description>Extra_I about ~400uA</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>ge30MHz</name><description>Extra_I about ~450uA</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>ge50MHz</name><description>Extra_I about ~550uA</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>ge100MHz</name><description>Extra_I about ~650uA</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>ge1MHz</name><description>Extra_I about ~300uA</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>ge500KHz</name><description>Extra_I about ~200uA</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>ge100KHz</name><description>Extra_I about ~100uA</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>ge10KHz</name><description>Extra_I about ~50uA</description><value>7</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO0_Trim</name>
              <description>LDO voltage tuning</description>
              <bitRange>[5:3]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>add_0v01</name><description>LD0 extra voltage +0.01V</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>add_0v05</name><description>LD0 extra voltage +0.05V</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>add_0v1</name><description>LD0 extra voltage +0.1V</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>add_0v15</name><description>LD0 extra voltage +0.15V</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>sub_0v01</name><description>LD0 extra voltage -0.01V</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>sub_0v05</name><description>LD0 extra voltage -0.05V</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>sub_0v015</name><description>LD0 extra voltage -0.10V</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>sub_0v15</name><description>LD0 extra voltage -0.15V</description><value>7</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO0_En</name>
              <description>LDO Enable</description>
              <bitRange>[6:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>On</name><description>Enable</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Off</name><description>Disable</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO0_RDY</name>
              <description>LDO Ready</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>NotReady</name><description>DUcc not ready</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Ready</name><description>DUcc ready</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>  
            <field derivedFrom="LDO0_SRILow">
              <name>LDO1_SRILow</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field derivedFrom="LDO0_Trim">
              <name>LDO1_Trim</name>
              <bitRange>[13:11]</bitRange>
            </field>
            <field derivedFrom="LDO0_En">
              <name>LDO1_En</name>
              <bitRange>[14:14]</bitRange>
            </field>    
            <field derivedFrom="LDO0_RDY">
              <name>LDO1_RDY</name>
              <bitRange>[15:15]</bitRange>
            </field> 
            <field derivedFrom="LDO0_SRILow">
              <name>LDO2_SRILow</name>
              <bitRange>[18:16]</bitRange>
            </field>
            <field derivedFrom="LDO0_Trim">
              <name>LDO2_Trim</name>
              <bitRange>[21:19]</bitRange>
            </field>
            <field derivedFrom="LDO0_En">
              <name>LDO2_En</name>
              <bitRange>[22:22]</bitRange>
            </field>    
            <field derivedFrom="LDO0_RDY">
              <name>LDO2_RDY</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field derivedFrom="LDO0_SRILow">
              <name>LDO3_SRILow</name>
              <bitRange>[26:24]</bitRange>
            </field>
            <field derivedFrom="LDO0_Trim">
              <name>LDO3_Trim</name>
              <bitRange>[29:27]</bitRange>
            </field>
            <field derivedFrom="LDO0_En">
              <name>LDO3_En</name>
              <bitRange>[30:30]</bitRange>
            </field>    
            <field derivedFrom="LDO0_RDY">
              <name>LDO3_RDY</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
