lamer0k/CortexLib/Tools/RegistersGenerator/Milandr/MDR1986VE8.svd
      </registers>
      <!-- peripheral end-->
    </peripheral>
    <!-- #RAMD -->
    <!-- #ROM -->
    <!-- #CACHE -->
    <!-- #GPIOs -->
    <!--MDR_PORTA-->
    <peripheral>
      <name>MDR_PORTA</name>
      <version>1.0</version>
      <description>PORTA</description>
      <groupName>MDR_PORT</groupName>
      <baseAddress>0x40080000</baseAddress>
      <size>32</size>
      <addressBlock>
          <offset>0</offset>
          <size>0x8C</size>
          <usage>registers</usage>
      </addressBlock>
      <!--IRQ_PORTA-->
      <!--interrupt>
        <name>IRQ_PORTA</name>
        <value>83</value>
      </interrupt-->
      <registers>
        <!--KEY-->
        <register>
            <name>KEY</name>
            <description>Key lock Register</description>
            <addressOffset>0x00000000</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!--RXTX-->
        <register>
          <name>RXTX</name>
          <description>GPIO Pin Data Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <dim>32</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>0-31</dimIndex>
              <name>Pin_%s</name>
              <description>Pin data value</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue><name>Low</name><description>LOW Level Voltage</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>High</name><description>HIGH Level Voltage</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!--SRXTX-->
        <register>
          <name>RXTX_Set</name>
          <description>Set RXTX Bits</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <dim>32</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>0-31</dimIndex>
              <name>Pin_%s</name>
              <description>Set 1 to pin</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Do nothing</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>SET</name><description>Set pin</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!--CRXTX-->
        <register>
          <name>RXTX_Clear</name>
          <description>Clear RXTX Bits</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <dim>32</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>0-31</dimIndex>
              <name>Pin_%s</name>
              <description>Set 0 to pin</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Do nothing</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>CLEAR</name><description>Clear pin</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!--OE-->
        <register>
          <name>OE</name>
          <description>Pins Output Enable (Port function)</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <dim>32</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>0-31</dimIndex>
              <name>Pin_%s</name>
              <description>Pin Output Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue><name>IN</name><description>Input pin</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>OUT</name><description>Output pin</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!--SOE-->
        <register derivedFrom="MDR_PORTA.RXTX_Set">
          <name>OE_Set</name>
          <description>Set OE Pins</description>
          <addressOffset>0x00000010</addressOffset>
        </register>
        <!--COE-->
        <register derivedFrom="MDR_PORTA.RXTX_Clear">
          <name>OE_Clear</name>
          <description>Clear OE Pins</description>
          <addressOffset>0x00000014</addressOffset>
        </register>
        <!--FUNC0-->
        <register>
          <name>FUNC0</name>
          <description>Pin0 - Pin7 Functions</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>4</dimIncrement>
              <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
              <name>Func_Pin_%s</name>
              <description>Read SFUNC0 Register</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>PORT</name><description>User Pin control</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Func_1</name><description>Function periph pin control</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>Func_2</name><description>Function periph pin control</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>Func_3</name><description>Function periph pin control</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>Func_4</name><description>Function periph pin control</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>Func_5</name><description>Function periph pin control</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>Func_6</name><description>Function periph pin control</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>Func_7</name><description>Function periph pin control</description><value>7</value></enumeratedValue>
                <enumeratedValue><name>Func_8</name><description>Function periph pin control</description><value>8</value></enumeratedValue>
                <enumeratedValue><name>Func_9</name><description>Function periph pin control</description><value>9</value></enumeratedValue>
                <enumeratedValue><name>Func_10</name><description>Function periph pin control</description><value>10</value></enumeratedValue>
                <enumeratedValue><name>Func_11</name><description>Function periph pin control</description><value>11</value></enumeratedValue>
                <enumeratedValue><name>Func_12</name><description>Function periph pin control</description><value>12</value></enumeratedValue>
                <enumeratedValue><name>Func_13</name><description>Function periph pin control</description><value>13</value></enumeratedValue>
                <enumeratedValue><name>Func_14</name><description>Function periph pin control</description><value>14</value></enumeratedValue>
                <enumeratedValue><name>Func_15</name><description>Function periph pin control</description><value>15</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!--FUNC1-->
        <register>
          <name>FUNC1</name>
          <description>Pin8 - Pin15 Functions</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>4</dimIncrement>
              <dimIndex>8,9,10,11,12,13,14,15</dimIndex>
              <name>Func_Pin_%s</name>
              <description>Read SFUNC1 Register</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>PORT</name><description>User Pin control</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Func_1</name><description>Function periph pin control</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>Func_2</name><description>Function periph pin control</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>Func_3</name><description>Function periph pin control</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>Func_4</name><description>Function periph pin control</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>Func_5</name><description>Function periph pin control</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>Func_6</name><description>Function periph pin control</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>Func_7</name><description>Function periph pin control</description><value>7</value></enumeratedValue>
                <enumeratedValue><name>Func_8</name><description>Function periph pin control</description><value>8</value></enumeratedValue>
                <enumeratedValue><name>Func_9</name><description>Function periph pin control</description><value>9</value></enumeratedValue>
                <enumeratedValue><name>Func_10</name><description>Function periph pin control</description><value>10</value></enumeratedValue>
                <enumeratedValue><name>Func_11</name><description>Function periph pin control</description><value>11</value></enumeratedValue>
                <enumeratedValue><name>Func_12</name><description>Function periph pin control</description><value>12</value></enumeratedValue>
                <enumeratedValue><name>Func_13</name><description>Function periph pin control</description><value>13</value></enumeratedValue>
                <enumeratedValue><name>Func_14</name><description>Function periph pin control</description><value>14</value></enumeratedValue>
                <enumeratedValue><name>Func_15</name><description>Function periph pin control</description><value>15</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!--FUNC2-->
        <register>
          <name>FUNC2</name>
          <description>Pin16 - Pin23 Functions</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>4</dimIncrement>
              <dimIndex>16,17,18,19,20,21,22,23</dimIndex>
              <name>Func_Pin_%s</name>
              <description>Read SFUNC2 Register</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>PORT</name><description>User Pin control</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Func_1</name><description>Function periph pin control</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>Func_2</name><description>Function periph pin control</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>Func_3</name><description>Function periph pin control</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>Func_4</name><description>Function periph pin control</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>Func_5</name><description>Function periph pin control</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>Func_6</name><description>Function periph pin control</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>Func_7</name><description>Function periph pin control</description><value>7</value></enumeratedValue>
                <enumeratedValue><name>Func_8</name><description>Function periph pin control</description><value>8</value></enumeratedValue>
                <enumeratedValue><name>Func_9</name><description>Function periph pin control</description><value>9</value></enumeratedValue>
                <enumeratedValue><name>Func_10</name><description>Function periph pin control</description><value>10</value></enumeratedValue>
                <enumeratedValue><name>Func_11</name><description>Function periph pin control</description><value>11</value></enumeratedValue>
                <enumeratedValue><name>Func_12</name><description>Function periph pin control</description><value>12</value></enumeratedValue>
                <enumeratedValue><name>Func_13</name><description>Function periph pin control</description><value>13</value></enumeratedValue>
                <enumeratedValue><name>Func_14</name><description>Function periph pin control</description><value>14</value></enumeratedValue>
                <enumeratedValue><name>Func_15</name><description>Function periph pin control</description><value>15</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!--FUNC3-->
        <register>
          <name>FUNC3</name>
          <description>Pin24 - Pin31 Functions</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>4</dimIncrement>
              <dimIndex>24,25,26,27,28,29,30,31</dimIndex>
              <name>Func_Pin_%s</name>
              <description>Read SFUNC3 Register</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>PORT</name><description>User Pin control</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Func_1</name><description>Function periph pin control</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>Func_2</name><description>Function periph pin control</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>Func_3</name><description>Function periph pin control</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>Func_4</name><description>Function periph pin control</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>Func_5</name><description>Function periph pin control</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>Func_6</name><description>Function periph pin control</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>Func_7</name><description>Function periph pin control</description><value>7</value></enumeratedValue>
                <enumeratedValue><name>Func_8</name><description>Function periph pin control</description><value>8</value></enumeratedValue>
                <enumeratedValue><name>Func_9</name><description>Function periph pin control</description><value>9</value></enumeratedValue>
                <enumeratedValue><name>Func_10</name><description>Function periph pin control</description><value>10</value></enumeratedValue>
                <enumeratedValue><name>Func_11</name><description>Function periph pin control</description><value>11</value></enumeratedValue>
                <enumeratedValue><name>Func_12</name><description>Function periph pin control</description><value>12</value></enumeratedValue>
                <enumeratedValue><name>Func_13</name><description>Function periph pin control</description><value>13</value></enumeratedValue>
                <enumeratedValue><name>Func_14</name><description>Function periph pin control</description><value>14</value></enumeratedValue>
                <enumeratedValue><name>Func_15</name><description>Function periph pin control</description><value>15</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!--SFUNC0-->
        <register derivedFrom="MDR_PORTA.FUNC0">
          <name>FUNC0_Set</name>
          <description>Set FUNC0 bits</description>
          <addressOffset>0x00000018</addressOffset>
          <access>write-only</access>
        </register>
        <!--SFUNC1-->
        <register derivedFrom="MDR_PORTA.FUNC1">
          <name>FUNC1_Set</name>
          <description>Set FUNC1 bits</description>
          <addressOffset>0x0000001C</addressOffset>
          <access>write-only</access>
        </register>
