lamer0k/CortexLib/Tools/RegistersGenerator/Milandr/MDR1986VE8.svd
        <!--IE-->
        <register>
          <name>IE</name>
          <description>Pin Level IRQ Enable</description>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <dim>32</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>0-31</dimIndex>
              <name>Pin_%s</name>
              <description>Read register SIE</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>IRQ disabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>IRQ enable</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!--SIE-->
        <register derivedFrom="MDR_PORTA.RXTX_Set">
          <name>IE_Set</name>
          <description>Set IE bits</description>
          <addressOffset>0x00000070</addressOffset>
        </register>
        <!--CIE-->
        <register derivedFrom="MDR_PORTA.RXTX_Clear">
          <name>IE_Clear</name>
          <description>Clear IE bits</description>
          <addressOffset>0x00000074</addressOffset>
        </register>
        <!--IT-->
        <register>
          <name>IT</name>
          <description>IRQ Level Select</description>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <dim>32</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>0-31</dimIndex>
              <name>Pin_%s</name>
              <description>Read register SIT</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Low</name><description>IRQ by low level</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>HIGH</name><description>IRQ by High level</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!--SIT-->
        <register derivedFrom="MDR_PORTA.RXTX_Set">
          <name>IT_Set</name>
          <description>Set IT bits</description>
          <addressOffset>0x00000078</addressOffset>
        </register>
        <!--CIT-->
        <register derivedFrom="MDR_PORTA.RXTX_Clear">
          <name>IT_Clear</name>
          <description>Clear IT bits</description>
          <addressOffset>0x0000007C</addressOffset>
        </register>
        <!--IR-->
        <register>
          <name>IR</name>
          <description>Read SIR Register</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <dim>32</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>0-31</dimIndex>
              <name>Pin_%s</name>
              <description>Read register SIR</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                  <enumeratedValue><name>Off</name><description>Inactive IRQ request</description><value>0</value></enumeratedValue>
                  <enumeratedValue><name>On</name><description>Active IRQ request</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!--SIR-->
        <register derivedFrom="MDR_PORTA.RXTX_Set">
          <name>IR_Set</name>
          <description>Set IR bits</description>
          <addressOffset>0x00000080</addressOffset>
        </register>
        <!--CIR-->
        <register derivedFrom="MDR_PORTA.RXTX_Clear">
          <name>IR_Clear</name>
          <description>Clear IR bits</description>
          <addressOffset>0x00000084</addressOffset>
        </register>
        <!--HCUR-->
        <register>
          <name>HCUR</name>
          <description>Pins' Overcurrent Status</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <dim>32</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>0-31</dimIndex>
              <name>Pin_%s</name>
              <description>Register HCUR</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                  <enumeratedValue><name>Off</name><description>Overcurrent is inactive</description><value>0</value></enumeratedValue>
                  <enumeratedValue><name>On</name><description>Overcurrent is active</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--MDR_PORTB-->
    <peripheral derivedFrom="MDR_PORTA">
        <name>MDR_PORTB</name>
        <description>PORTB</description>
        <baseAddress>0x40081000</baseAddress>
        <!--interrupt>
          <name>IRQ_PORTB</name>
          <value>84</value>
        </interrupt-->
    </peripheral>
    <!--MDR_PORTC-->
    <peripheral derivedFrom="MDR_PORTA">
        <name>MDR_PORTC</name>
        <description>PORTC</description>
        <baseAddress>0x40082000</baseAddress>
        <!--interrupt>
          <name>IRQ_PORTC</name>
          <value>85</value>
        </interrupt-->
    </peripheral>
    <!--MDR_PORTD-->
    <peripheral derivedFrom="MDR_PORTA">
        <name>MDR_PORTD</name>
        <description>PORTD</description>
        <baseAddress>0x40083000</baseAddress>
        <!--interrupt>
          <name>IRQ_PORTD</name>
          <value>86</value>
        </interrupt-->
    </peripheral>
