lamer0k/CortexLib/Tools/RegistersGenerator/Milandr/MDR1986VE8.svd
        <!--CH3_CNTRL-->
        <register derivedFrom="CH1_CNTRL">
          <name>CH3_CNTRL</name>
          <addressOffset>0x00000028</addressOffset>
        </register>
        <!--CH4_CNTRL-->
        <register  derivedFrom="CH1_CNTRL">
          <name>CH4_CNTRL</name>
          <addressOffset>0x0000002C</addressOffset>
        </register>
        <!--CH1_CNTRL1-->
        <register>
          <name>CH1_CNTRL1</name>
          <description>PWM Driver Control</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001F1F</resetMask>
          <fields>
            <field>
              <name>SelOE</name>
              <description>Select Pin Output Enable</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>IN</name><description>Pin IN</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>OUT</name><description>Pin OUT</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>IO_byRef</name><description>Pin IN or OUT by Ref signal</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>IO_byDTG</name><description>Pin IN or OUT by DTG signal</description><value>3</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SelO</name>
              <description>Select Output Signal</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Low</name><description>Outputs const GND</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>High</name><description>Outputs const Ucc</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>Ref</name><description>Ref PWM signal</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>DTG</name><description>DTG PWM signal</description><value>3</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Inv</name>
              <description>Invert Output Signal</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Not Inverted</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Inverted</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="SelOE">
              <name>NSelOE</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field derivedFrom="SelO">
              <name>NSelO</name>
              <bitRange>[11:10]</bitRange>
            </field>
            <field derivedFrom="Inv">
              <name>NInv</name>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <!--CH2_CNTRL1-->
        <register  derivedFrom="CH1_CNTRL1">
          <name>CH2_CNTRL1</name>
          <addressOffset>0x00000034</addressOffset>
        </register>
        <!--CH3_CNTRL1-->
        <register derivedFrom="CH1_CNTRL1">
          <name>CH3_CNTRL1</name>
          <addressOffset>0x00000038</addressOffset>
        </register>
        <!--CH4_CNTRL1-->
        <register  derivedFrom="CH1_CNTRL1">
          <name>CH4_CNTRL1</name>
          <addressOffset>0x0000003C</addressOffset>
        </register>
        <!--CH1_DTG-->
        <register>
          <name>CH1_DTG</name>
          <description>Dead Time Generator</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FF1F</resetMask>
          <fields>
            <field>
              <name>DTG</name>
              <description>DTG Prescaller</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>x0</name><description>Prescaler DTG</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>x1</name><description>Prescaler DTG</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>x2</name><description>Prescaler DTG</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>x3</name><description>Prescaler DTG</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>x4</name><description>Prescaler DTG</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>x5</name><description>Prescaler DTG</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>x6</name><description>Prescaler DTG</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>x7</name><description>Prescaler DTG</description><value>7</value></enumeratedValue>
                <enumeratedValue><name>x8</name><description>Prescaler DTG</description><value>8</value></enumeratedValue>
                <enumeratedValue><name>x9</name><description>Prescaler DTG</description><value>9</value></enumeratedValue>
                <enumeratedValue><name>x10</name><description>Prescaler DTG</description><value>10</value></enumeratedValue>
                <enumeratedValue><name>x11</name><description>Prescaler DTG</description><value>11</value></enumeratedValue>
                <enumeratedValue><name>x12</name><description>Prescaler DTG</description><value>12</value></enumeratedValue>
                <enumeratedValue><name>x13</name><description>Prescaler DTG</description><value>13</value></enumeratedValue>
                <enumeratedValue><name>x14</name><description>Prescaler DTG</description><value>14</value></enumeratedValue>
                <enumeratedValue><name>x15</name><description>Prescaler DTG</description><value>15</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDTS</name>
              <description>DTG Clock Select</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>TIM_Clock</name><description>Pin IN</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>FDTS</name><description>Pin OUT</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTGx</name>
              <description>DTGx scale, Delay = DTGx*(DTG + 1)</description>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
