lamer0k/CortexLib/Tools/RegistersGenerator/Milandr/MDR1986VE8.svd
        <!--CH1_CNTRL2-->
        <register>
          <name>CH1_CNTRL2</name>
          <description>CCR1 Control</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000FF</resetMask>
          <fields>
            <field>
              <name>CHSel1</name>
              <description>Event to capture in CCR1</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Rise_Pin</name><description>Capture Event Select</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Fall_Pin</name><description>Capture Event Select</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>Fall_NextCH</name><description>Capture Event Select</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>Fall_NextNextCH</name><description>Capture Event Select</description><value>3</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCR1_En</name>
              <description>Enable CCR1</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disable</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enable</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCRRLD</name>
              <description>CCR Reload Mode</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Immediately</name><description>Immediately update CCR and CCR1</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>byPreriodCNT</name><description>Update on period completed</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP_CCR_Fix</name>
              <description>CAP update CCRs fix</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Inactive</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Active</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!--CH2_CNTRL2-->
        <register  derivedFrom="CH1_CNTRL2">
          <name>CH2_CNTRL2</name>
          <addressOffset>0x00000064</addressOffset>
        </register>
        <!--CH3_CNTRL2-->
        <register  derivedFrom="CH1_CNTRL2">
          <name>CH3_CNTRL2</name>
          <addressOffset>0x00000068</addressOffset>
        </register>
        <!--CH4_CNTRL2-->
        <register  derivedFrom="CH1_CNTRL2">
          <name>CH4_CNTRL2</name>
          <addressOffset>0x0000006C</addressOffset>
        </register>
        <!--CCR11-->
        <register derivedFrom="CCR1">
          <name>CCR11</name>
          <addressOffset>0x00000070</addressOffset>
        </register>
        <!--CCR21-->
        <register derivedFrom="CCR1">
          <name>CCR21</name>
          <addressOffset>0x00000074</addressOffset>
        </register>
        <!--CCR31-->
        <register derivedFrom="CCR1">
          <name>CCR31</name>
          <addressOffset>0x00000078</addressOffset>
        </register>
        <!--CCR41-->
        <register derivedFrom="CCR1">
          <name>CCR41</name>
          <addressOffset>0x0000007C</addressOffset>
        </register>
        <!-- #TIMER_MDA_REX_VE1 -->
        <!--DMA_RE1-->
        <register derivedFrom="DMA_RE">
          <name>DMA_RE1</name>
          <description>DMA Request Enable for TIMx_DMA_REQ1</description>
          <addressOffset>0x00000080</addressOffset>
        </register>
        <!--DMA_RE2-->
        <register derivedFrom="DMA_RE">
          <name>DMA_RE2</name>
          <description>DMA Request Enable for TIMx_DMA_REQ2</description>
          <addressOffset>0x00000084</addressOffset>
        </register>
        <!--DMA_RE3-->
        <register derivedFrom="DMA_RE">
          <name>DMA_RE3</name>
          <description>DMA Request Enable for TIMx_DMA_REQ3</description>
          <addressOffset>0x00000088</addressOffset>
        </register>
        <!--DMA_RE4-->
        <register derivedFrom="DMA_RE">
          <name>DMA_RE4</name>
          <description>DMA Request Enable for TIMx_DMA_REQ4</description>
          <addressOffset>0x0000008C</addressOffset>
        </register>
      </registers>
      <!-- peripheral end-->
    </peripheral>
    <!-- #MDR_TIMER2 -->
    <peripheral derivedFrom="MDR_TIMER1">
      <name>MDR_TIMER2</name>
      <baseAddress>0x4008B000</baseAddress>
    </peripheral>
    <!-- #MDR_TIMER3 -->
    <peripheral derivedFrom="MDR_TIMER1">
      <name>MDR_TIMER3</name>
      <baseAddress>0x4008C000</baseAddress>
    </peripheral>
    <!-- #MDR_TIMER4 -->
    <peripheral derivedFrom="MDR_TIMER1">
      <name>MDR_TIMER4</name>
      <baseAddress>0x4008D000</baseAddress>
    </peripheral>
    <!-- #MDR_TIMER5 -->
    <!-- #MDR_TIMER6 -->
    <!-- #CANs -->
    <!-- #SSPs  -->
    <!-- SSP1 -->
    <peripheral>
      <name>MDR_SSP1</name>
      <version>2.0</version>
      <description>Synchronous Serial Port</description>
      <groupName>SSP</groupName>
      <!-- #SSP1_ADDR -->
      <baseAddress>0x40095000</baseAddress>
      <size>32</size>
      <access>read-write</access>
      <addressBlock>
        <offset>0</offset>
        <size>0x28</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <!-- CR0 -->
        <register>
          <name>CR0</name>
          <description>Control Register 0</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>DSS</name>
              <description>Data Size Select</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue><name>bits_4</name><description>Word of 4 bits</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>bits_5</name><description>Word of 5 bits</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>bits_6</name><description>Word of 6 bits</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>bits_7</name><description>Word of 7 bits</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>bits_8</name><description>Word of 8 bits</description><value>7</value></enumeratedValue>
                <enumeratedValue><name>bits_9</name><description>Word of 9 bits</description><value>8</value></enumeratedValue>
                <enumeratedValue><name>bits_10</name><description>Word of 10 bits</description><value>9</value></enumeratedValue>
                <enumeratedValue><name>bits_11</name><description>Word of 11 bits</description><value>10</value></enumeratedValue>
                <enumeratedValue><name>bits_12</name><description>Word of 12 bits</description><value>11</value></enumeratedValue>
                <enumeratedValue><name>bits_13</name><description>Word of 13 bits</description><value>12</value></enumeratedValue>
                <enumeratedValue><name>bits_14</name><description>Word of 14 bits</description><value>13</value></enumeratedValue>
                <enumeratedValue><name>bits_15</name><description>Word of 15 bits</description><value>14</value></enumeratedValue>
                <enumeratedValue><name>bits_16</name><description>Word of 16 bits</description><value>15</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRF</name>
              <description>Frame Format</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI</name><description>Motorola SPI protocol</description><value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI</name><description>Texas Instruments SSI protocol</description><value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Microwire</name><description>National Semiconductor Microwire protocol</description><value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPO</name>
              <description>SPI Clock Polarity</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Idle_Low</name><description>Idle state is Low</description><value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Idle_High</name><description>Idle state is High</description><value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPH</name>
              <description>SPI Capture Clock Phase</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Leading</name><description>Capture data on leading edge</description><value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Trailing</name><description>Capture data on trailing edge</description><value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCR</name>
              <description>Signal CLock Rate</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <!-- #ES_Ex_CR0 -->
          </fields>
        </register>
