lamer0k/CortexLib/Tools/RegistersGenerator/Milandr/MDR1986VE8.svd
        <!-- CTRL_BASE_PTR -->
        <register>
          <name>CTRL_BASE_PTR</name>
          <description>Channel control data base pointer</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000000</resetValue>
          <resetMask>0xFFFFFC00</resetMask>
          <fields>
            <field>
              <name>Addr_Hi</name>
              <description>Pointer</description>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>  
        </register>
        <!-- ALT_CTRL_BASE_PTR -->
        <register>
          <name>ALT_CTRL_BASE_PTR</name>
          <description>Channel alternate control data base pointer</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0000000</resetValue>
          <resetMask>0xFFFFFC00</resetMask>
          <fields>
            <field>
              <name>Addr</name>
              <description>Pointer</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>  
        </register>
        <!-- WAITONREQ_STATUS -->
        <register>
          <name>WAITONREQ_STATUS</name>
          <description>Channel wait on request status</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <dim>32</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>0-31</dimIndex>
              <name>Ch_%s</name>
              <description>Channel Select</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Inactive</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Active</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!-- CHNL_SW_REQUEST -->
        <register derivedFrom="WAITONREQ_STATUS">
          <name>CHNL_SW_REQUEST</name>
          <description>Channel Software Request</description>
          <addressOffset>0x00000014</addressOffset>
          <access>write-only</access>
          <modifiedWriteValues>oneToSet</modifiedWriteValues>
        </register>
        <!-- CHNL_USEBURST_SET -->
        <register derivedFrom="WAITONREQ_STATUS">
          <name>CHNL_USEBURST_SET</name>
          <description>Disable SREQ requests</description>
          <addressOffset>0x00000018</addressOffset>
          <access>read-write</access>
          <modifiedWriteValues>oneToSet</modifiedWriteValues>
        </register>
        <!-- CHNL_USEBURST_CLR -->
        <register derivedFrom="WAITONREQ_STATUS">
          <name>CHNL_USEBURST_CLR</name>
          <description>Enable SREQ requests</description>
          <addressOffset>0x0000001C</addressOffset>
          <access>write-only</access>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
        </register>
        <!-- CHNL_REQ_MASK_SET -->
        <register derivedFrom="WAITONREQ_STATUS">
          <name>CHNL_REQ_MASK_SET</name>
          <description>Disable channel processing</description>
          <addressOffset>0x00000020</addressOffset>
          <access>read-write</access>
          <modifiedWriteValues>oneToSet</modifiedWriteValues>
        </register>
        <!-- CHNL_REQ_MASK_CLR -->
        <register derivedFrom="WAITONREQ_STATUS">
          <name>CHNL_REQ_MASK_CLR</name>
          <description>Enable channel processing</description>
          <addressOffset>0x00000024</addressOffset>
          <access>write-only</access>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
        </register>
        <!-- CHNL_ENABLE_SET -->
        <register derivedFrom="WAITONREQ_STATUS">
          <name>CHNL_ENABLE_SET</name>
          <description>Start Channel</description>
          <addressOffset>0x00000028</addressOffset>
          <access>read-write</access>
          <modifiedWriteValues>oneToSet</modifiedWriteValues>
        </register>
        <!-- CHNL_ENABLE_CLR -->
        <register derivedFrom="WAITONREQ_STATUS">
          <name>CHNL_ENABLE_CLR</name>
          <description>Stop Channel</description>
          <addressOffset>0x0000002C</addressOffset>
          <access>write-only</access>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
        </register>
        <!-- CHNL_PRI_ALT_SET -->
        <register derivedFrom="WAITONREQ_STATUS">
          <name>CHNL_PRI_ALT_SET</name>
          <description>Select Alter Structure</description>
          <addressOffset>0x00000030</addressOffset>
          <access>read-write</access>
          <modifiedWriteValues>oneToSet</modifiedWriteValues>
        </register>
        <!-- CHNL_PRI_ALT_CLR -->
        <register derivedFrom="WAITONREQ_STATUS">
          <name>CHNL_PRI_ALT_CLR</name>
          <description>Select Primary Structure</description>
          <addressOffset>0x00000034</addressOffset>
          <access>write-only</access>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
        </register>
        <!-- CHNL_PRIORITY_SET -->
        <register derivedFrom="WAITONREQ_STATUS">
          <name>CHNL_PRIORITY_SET</name>
          <description>Rise up priority to High</description>
          <addressOffset>0x00000038</addressOffset>
          <access>read-write</access>
          <modifiedWriteValues>oneToSet</modifiedWriteValues>
        </register>
        <!-- CHNL_PRIORITY_CLR -->
        <register derivedFrom="WAITONREQ_STATUS">
          <name>CHNL_PRIORITY_CLR</name>
          <description>Clear Priority to Normal</description>
          <addressOffset>0x0000003C</addressOffset>
          <access>write-only</access>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
        </register>    
        <!-- ERR_CLR -->
        <register derivedFrom="WAITONREQ_STATUS">
          <name>ERR_CLR</name>
          <description>AHB-Lite bus  error clear</description>
          <addressOffset>0x0000004C</addressOffset>
          <access>read-write</access>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
        </register>
        <!-- #DMA_MUX -->
        <register>
          <name>CHMUX0</name>
          <description>Periph select for DMA channels 0..3</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH0_Sel</name>
              <description>Periph Event for DMA_Channel</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field derivedFrom="CH0_Sel">
              <name>CH1_Sel</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field derivedFrom="CH0_Sel">
              <name>CH2_Sel</name>
              <bitRange>[23:16]</bitRange>
            </field>
            <field derivedFrom="CH0_Sel">
              <name>CH3_Sel</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHMUX1</name>
          <description>Periph select for DMA channels 4..7</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field derivedFrom="MDR_DMA.CHMUX0.CH0_Sel">
              <name>CH4_Sel</name>
              <bitRange>[7:0]</bitRange>      
            </field>
            <field derivedFrom="MDR_DMA.CHMUX0.CH0_Sel">
              <name>CH5_Sel</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field derivedFrom="MDR_DMA.CHMUX0.CH0_Sel">
              <name>CH6_Sel</name>
              <bitRange>[23:16]</bitRange>
            </field>
            <field derivedFrom="MDR_DMA.CHMUX0.CH0_Sel">
              <name>CH7_Sel</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHMUX2</name>
          <description>Periph select for DMA channels 8..11</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field derivedFrom="MDR_DMA.CHMUX0.CH0_Sel">
              <name>CH8_Sel</name>
              <bitRange>[7:0]</bitRange>      
            </field>
            <field derivedFrom="MDR_DMA.CHMUX0.CH0_Sel">
              <name>CH9_Sel</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field derivedFrom="MDR_DMA.CHMUX0.CH0_Sel">
              <name>CH10_Sel</name>
              <bitRange>[23:16]</bitRange>
            </field>
            <field derivedFrom="MDR_DMA.CHMUX0.CH0_Sel">
              <name>CH11_Sel</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHMUX3</name>
          <description>Periph select for DMA channels 12..15</description>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field derivedFrom="MDR_DMA.CHMUX0.CH0_Sel">
              <name>CH12_Sel</name>
              <bitRange>[7:0]</bitRange>      
            </field>
            <field derivedFrom="MDR_DMA.CHMUX0.CH0_Sel">
              <name>CH13_Sel</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field derivedFrom="MDR_DMA.CHMUX0.CH0_Sel">
              <name>CH14_Sel</name>
              <bitRange>[23:16]</bitRange>
            </field>
            <field derivedFrom="MDR_DMA.CHMUX0.CH0_Sel">
              <name>CH15_Sel</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHMUX4</name>
          <description>Periph select for DMA channels 16..19</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field derivedFrom="MDR_DMA.CHMUX0.CH0_Sel">
              <name>CH16_Sel</name>
              <bitRange>[7:0]</bitRange>      
            </field>
            <field derivedFrom="MDR_DMA.CHMUX0.CH0_Sel">
              <name>CH17_Sel</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field derivedFrom="MDR_DMA.CHMUX0.CH0_Sel">
              <name>CH18_Sel</name>
              <bitRange>[23:16]</bitRange>
            </field>
            <field derivedFrom="MDR_DMA.CHMUX0.CH0_Sel">
              <name>CH19_Sel</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHMUX5</name>
          <description>Periph select for DMA channels 20..23</description>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field derivedFrom="MDR_DMA.CHMUX0.CH0_Sel">
              <name>CH20_Sel</name>
              <bitRange>[7:0]</bitRange>      
            </field>
            <field derivedFrom="MDR_DMA.CHMUX0.CH0_Sel">
              <name>CH21_Sel</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field derivedFrom="MDR_DMA.CHMUX0.CH0_Sel">
              <name>CH22_Sel</name>
              <bitRange>[23:16]</bitRange>
            </field>
            <field derivedFrom="MDR_DMA.CHMUX0.CH0_Sel">
              <name>CH23_Sel</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHMUX6</name>
          <description>Periph select for DMA channels 24..27</description>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field derivedFrom="MDR_DMA.CHMUX0.CH0_Sel">
              <name>CH24_Sel</name>
              <bitRange>[7:0]</bitRange>      
            </field>
            <field derivedFrom="MDR_DMA.CHMUX0.CH0_Sel">
              <name>CH25_Sel</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field derivedFrom="MDR_DMA.CHMUX0.CH0_Sel">
              <name>CH26_Sel</name>
              <bitRange>[23:16]</bitRange>
            </field>
            <field derivedFrom="MDR_DMA.CHMUX0.CH0_Sel">
              <name>CH27_Sel</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHMUX7</name>
          <description>Periph select for DMA channels 28..31</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field derivedFrom="MDR_DMA.CHMUX0.CH0_Sel">
              <name>CH28_Sel</name>
              <bitRange>[7:0]</bitRange>      
            </field>
            <field derivedFrom="MDR_DMA.CHMUX0.CH0_Sel">
              <name>CH29_Sel</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field derivedFrom="MDR_DMA.CHMUX0.CH0_Sel">
              <name>CH30_Sel</name>
              <bitRange>[23:16]</bitRange>
            </field>
            <field derivedFrom="MDR_DMA.CHMUX0.CH0_Sel">
              <name>CH31_Sel</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <!-- Registers end-->
      </registers>
      <!-- peripheral end-->
    </peripheral>
    <!-- #ICACHE -->
    <!-- #DCACHE -->

    <!-- peripherals end-->
  </peripherals>

</device>  
